app/Models/ModelLaporan.php

SELECT `tbl_rinci`.`kode_produk`, `tbl_produk`.`nama_produk`, `tbl_rinci`.`modal`, `tbl_rinci`.`harga`, SUM(`tbl_rinci`.`qty`) AS `qty`, SUM(`tbl_rinci`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci`.`untung`) AS `untung`
FROM `tbl_rinci`
JOIN `tbl_produk` ON `tbl_produk`.`kode_produk`=`tbl_rinci`.`kode_produk`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci`.`no_faktur`
WHERE `tbl_jual`.`tgl_jual` = '2024-02-27'
GROUP BY `tbl_rinci`.`kode_produk`
---
    public function DataHarian($tgl)
    {
        return $this->db->table('tbl_rinci')
        ->join('tbl_produk', 'tbl_produk.kode_produk=tbl_rinci.kode_produk')
        ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci.no_faktur')
        ->where('tbl_jual.tgl_jual', $tgl)
        ->select('tbl_rinci.kode_produk')
        ->select('tbl_produk.nama_produk')
        ->select('tbl_rinci.modal')
        ->select('tbl_rinci.harga')
        ->groupBy('tbl_rinci.kode_produk')
        ->selectSum('tbl_rinci.qty')
        ->selectSum('tbl_rinci.total_harga')
        ->selectSum('tbl_rinci.untung')
        ->get()->getResultArray();