app/Models/ModelAdmin.php

SELECT *
FROM `tbl_setting`
WHERE `id` = '1'
---
    public function DetailData()
    {
     return $this->db->table('tbl_setting')->where('id','1')->get()->getRowArray();

UPDATE `tbl_setting` SET `id` = '1', `nama_toko` = 'Market Uncle ', `slogan` = 'Haya pork Bbq is Halal?', `alamat` = 'Jl. Tentara Pelajar', `no_telpon` = '08999999999', `deskripsi` = 'apa saja\r\n'
WHERE `id` = '1'
---
   public function UpdateSetting($data)
   {
      $this->db->table('tbl_setting')
      ->where('id', $data['id'])
      ->update($data);

SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci`.`total_harga`) AS `total_harga`, SUM(`tbl_rinci`.`untung`) AS `untung`
FROM `tbl_rinci`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '02'
AND year(tbl_jual.tgl_jual) = '2024'
GROUP BY `tbl_jual`.`tgl_jual`
---
   public function Grafik()
   {
      return $this->db->table('tbl_rinci')
        ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci.no_faktur')
        ->where('month(tbl_jual.tgl_jual)', date('m'))
        ->where('year(tbl_jual.tgl_jual)', date('Y'))
        ->select('tbl_jual.tgl_jual')
        ->groupBy('tbl_jual.tgl_jual')
        ->selectSum('tbl_rinci.total_harga')
        ->selectSum('tbl_rinci.untung')
        ->get()->getResultArray();

SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci`.`total_harga`) AS `total_harga`
FROM `tbl_rinci`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci`.`no_faktur`
WHERE `tbl_jual`.`tgl_jual` = '2024-02-27'
GROUP BY `tbl_jual`.`tgl_jual`
---
   public function PendapatanHarian()
   {
      return $this->db->table('tbl_rinci')
      ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci.no_faktur')
      ->where('tbl_jual.tgl_jual', date('Y-m-d'))
      ->select('tbl_jual.tgl_jual')
      ->groupBy('tbl_jual.tgl_jual')
      ->selectSum('tbl_rinci.total_harga')
      ->get()->getRowArray();

SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci`.`total_harga`) AS `total_harga`
FROM `tbl_rinci`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci`.`no_faktur`
WHERE month(tbl_jual.tgl_jual) = '02'
AND year(tbl_jual.tgl_jual) = '2024'
GROUP BY month(tbl_jual.tgl_jual)
---
   public function PendapatanBulanan()
   {
      return $this->db->table('tbl_rinci')
      ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci.no_faktur')
      ->where('month(tbl_jual.tgl_jual)', date('m'))
      ->where('year(tbl_jual.tgl_jual)', date('Y'))
      ->select('tbl_jual.tgl_jual')
      ->groupBy('month(tbl_jual.tgl_jual)')
      ->selectSum('tbl_rinci.total_harga')
      ->get()->getRowArray();

SELECT `tbl_jual`.`tgl_jual`, SUM(`tbl_rinci`.`total_harga`) AS `total_harga`
FROM `tbl_rinci`
JOIN `tbl_jual` ON `tbl_jual`.`no_faktur`=`tbl_rinci`.`no_faktur`
WHERE year(tbl_jual.tgl_jual) = '2024'
GROUP BY year(tbl_jual.tgl_jual)
---
   public function PendapatanTahunan()
   {
      return $this->db->table('tbl_rinci')
      ->join('tbl_jual', 'tbl_jual.no_faktur=tbl_rinci.no_faktur')
      ->where('year(tbl_jual.tgl_jual)', date('Y'))
      ->select('tbl_jual.tgl_jual')
      ->groupBy('year(tbl_jual.tgl_jual)')
      ->selectSum('tbl_rinci.total_harga')
      ->get()->getRowArray();

SELECT COUNT(*) AS `numrows` FROM `tbl_produk`
---
   public function TotalProduk()
   {
      return $this->db->table('tbl_produk')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_kategori`
---
   public function TotalKategori()
   {
      return $this->db->table('tbl_kategori')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_satuan`
---
   public function TotalSatuan()
   {
      return $this->db->table('tbl_satuan')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
   public function TotalUser()
   {
      return $this->db->table('tbl_user')->countAll();