app/Models/ModelUser.php

SELECT *
FROM `tbl_user`
---
    public function AllData()
   {
    return $this->db->table('tbl_user')->get()->getResultArray();